# vim:ft=ruby

if OS.mac?
  # taps

  brew "noti" # utility to display notifications from scripts
  brew "trash" # rm, but put in the trash rather than completely delete

  # Applications
  cask "ghostty" # a better terminal emulator
  cask "1password/tap/1password-cli"

elsif OS.linux?
  brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-symbols-only-nerd-font"

tap "homebrew/bundle"

# packages
brew "starship" # Cross-shell prompt
brew "bat" # better cat
brew "git" # Git version control (latest version)
brew "lazygit" # A better git UI
brew "glow" # markdown viewer
brew "neovim" # A better vim
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "wget" # internet file retriever
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "eza" # ls alternative
brew "entr" # file watcher /command runner
brew "zsh" #install latest version of zsh
brew "luarocks" # Package manager for Lua modules (LazyVim uses it but is optional)
brew "virtualenv" # Python virtual environment
brew "node" # Node.js
brew "pipes.sh" # A sort of cli screensaver
